export const renderAreaAdcode = {
    'west' : [
        '530000',
        '510000',
        '520000',
    ],
    'south' : [
        '460000',
        '450000',
        '420000',
        '430000',
    ],
    'east' : [
        '350000',
        '340000',
        '320000',
        '330000',
    ],
    'dawan' : [
        '441900',
        '441300',
        '440300',
        '810000',
        // '440000'
    ],
    'north' : [
        '110000',
        '370000,',
        '210000',
        '130000',
        '140000',
    ],
    'all' : [
        '532800',
        '510100',
        '520100',
        '530100',
        '442000',
        '440700',
        '440100',
        '440600',
        '350200',
        '350100',
        '330300',
        '330700',
        '441900',
        '441300',
        '440300',
        '810000',
        '110000',
        '370100,',
        '370200',
        '210100',
        '210200',
    ],
    'eventListener' : [
        '130000',
        '140000',
        '210000',
        '220000',
        '230000',
        '320000',
        '330000',
        '340000',
        '350000',
        '360000',
        '370000',
        '410000',
        '420000',
        '430000',
        '440000',
        '460000',
        '510000',
        '520000',
        '530000',
        '610000',
        '620000',
        '630000',
        '710000',
        '100000'
    ]
}


export const areaAdcode = {
    '西区' : [
        {name : '西双版纳',adcode : '532800'},
        {name : '成都市',adcode : '510100'},
        {name : '贵阳市',adcode : '520100'},
        {name : '昆明市',adcode : '530100'}   
    ],
    '南区' : [
        {name : '中山市',adcode : '442000'},
        {name : '江门市',adcode : '440700'},
        {name : '广州市',adcode : '440100'},
        {name : '佛山市',adcode : '440600'},
    ],
    '东区' : [
        {name : '厦门市',adcode : '350200'},
        {name : '福州市',adcode : '350100'},
        {name : '温州市',adcode : '330300'},
        {name : '金华市',adcode : '330700'},
    ],
    '大湾区' : [
        {name : '东莞市',adcode : '441900'},
        {name : '惠州市',adcode : '441300'},
        {name : '深圳市',adcode : '440300'},
        {name : '香港特别行政区',adcode : '810000'},
    ],
    '北区' : [
        {name : '北京市',adcode : '110000'},
        {name : '济南市',adcode : '370100'},
        {name : '青岛市',adcode : '370200'},
        {name : '沈阳市',adcode : '210100'},
        {name : '大连市',adcode : '210200'},
        
    ],
}


export const homeList = [
    {
        lng : [121.462435, 31.189479],
        title : '公司',
        content : {
            address : '-',
            area : '-',
            unitprice : '-',
            totalprice : '-',
            floor : '-'
        }
    },
    {
        lng : [121.303,31.304206],
        title : '家',
        content : {
            address : '-',
            area : '-',
            unitprice : '-',
            totalprice : '-',
            floor : '-'
        }
    },
    {
        lng : [121.368373,31.188572],
        title : '程桥一村',
        content : {
            address : '长宁 西郊 中环至外环 近十号线',
            area : '40.01',
            unitprice : '64984元/平',
            totalprice : '260万',
            floor : '中楼层/共5层'
        }
    },
    {
        lng : [121.378983,31.097126],
        title : '沁春园一村',
        content : {
            address : '闵行 莘庄 外环外',
            area : '45.05',
            unitprice : '64373元/平',
            totalprice : '290万',
            floor : '高楼层/共6层'
        }
    },
    
]